INSERT INTO details -- Заполнение таблицы деталей
VALUES
(1, 'Блок управления ABS', 'XRF17H84HS1T'),
(2, 'Генератор', 'Q4QIY5A9M5ZV'),
(3, 'Карбюратор', 'F4179XM4YBX2'),
(4, 'Шаровая','1EB4VKTP3G49'),
(5, 'Тормозной суппорт','WDPIWC0UYHGG'),
(6, 'Тормозные диски','25PT6AHCZ66S'),
(7, 'Датчик распредвала','GERODYTFATYI'),
(8, 'Поперечный рычаг','H0P7MJH7RUNP'),
(9, 'Сальники коленвала','GZPLS99MUO80'),
(10, 'Прикуриватель', '5ZNEP16VQWLW'),
(11, 'Бензонасос','JWUMNG8UOITH'),
(12, 'Инжектор','V4EJ4COAPUB6'),
(13, 'Сцепление','TD2O35FDWDH8'),
(14, 'Коленвал','3YJ790OJ0V6S'),
(15, 'Маховик','YGQROHBCK9C6'),
(16, 'Радиатор печки','8CNQ6AZ279BP'),
(17, 'Глушитель','J6BK3VW2VWHI'),
(18, 'Стартер','8JF3N94I767V'),
(19, 'Рулевая рейка','UOW4AZRC0Y97'),
(20, 'Термостат','7AHFXIP7PLYB');

INSERT INTO provider -- Заполнение таблицы поставщиков
VALUES
(1, 'ABS-AUTO','Москва','8(800) 30-20-686'),
(2, 'Adeo Pro','Курск','8(495) 118-90-47'),
(3, 'Автоклондайк','Санкт-Петербург','8(495) 223-89-14'),
(4, 'Alfa-NW','Санкт-Петербург','8(495) 148-81-33'),
(5, 'All4Motors','Москва','8(495) 120-03-27');

INSERT INTO purchases -- Заполнение таблицы продаж
VALUES
(1, '2016-02-20', 15, 1, 1),
(2, '2012-03-22', 15, 1, 2),
(3, '2017-07-27', 15, 1, 3),
(4, '2014-02-23', 15, 1, 4),
(5, '2014-01-14', 15, 1, 5),
(6, '2018-02-20', 15, 2, 6),
(7, '2018-03-22', 15, 2, 7),
(8, '2018-07-27', 15, 2, 8),
(9, '2018-02-23', 15, 2, 9),
(10, '2018-01-14', 15, 2, 10),
(11, '2018-02-20', 15, 3, 11),
(12, '2018-03-22', 15, 3, 12),
(13, '2018-07-27', 15, 3, 13),
(14, '2018-02-23', 15, 3, 14),
(15, '2022-01-14', 15, 3, 15),
(16, '2022-02-10', 15, 4, 16),
(17, '2022-03-22', 15, 4, 17),
(18, '2022-07-27', 15, 4, 18),
(19, '2022-02-23', 15, 4, 19),
(20, '2022-01-14', 15, 4, 20),
(21, '2022-02-10', 15, 5, 1),
(22, '2022-03-22', 15, 5, 2),
(23, '2022-07-27', 15, 5, 3),
(24, '2022-02-23', 15, 5, 4),
(25, '2022-01-14', 15, 5, 5)

INSERT INTO price_history -- Заполнение таблицы истории цен
VALUES
(1, 16000, '2020-01-12', 1),
(2, 2000, '2021-02-12', 6),
(3, 6000, '2023-03-12', 17),
(4, 5000, '2018-05-27', 18),
(5, 7500, '2019-09-15', 2)